[
    {
      "id": 1,
      "make": "Mercedes-Benz",
      "model": "Mercedes-Benz C-Class",
      "fuelType": "Petrol & Diesel",
      "accelaration": "6.56 to 7.78 seconds",
      "topSpeed": "245 to 250 kmph",
      "engine": "1496 to 1993 cc",
      "price": "Rs. 65.99 Lakh",
      "year": "2022",
      "image": "https://imgd.aeplcdn.com/664x374/n/cw/ec/116201/new-c-class-exterior-right-front-three-quarter-2.jpeg?isig=0&q=75",
      "seatingCapacity": "5",
      "colors": "Selenite Grey, Mojave Silver, High-tech Silver, Manufaktur Opalite White, Cavansite Blue, Obsidian Black",
      "variants": "C200, C220d, C300d",
      "summary": "Powering the new Mercedes-Benz C-Class is a 1.5-litre, four-cylinder, turbo-petrol engine and a 2.0-litre, four-cylinder diesel engine. The former is available in the C200 guise, producing 201bhp and 300Nm of torque, while the latter is offered in the C220d and C300d guise, producing 197bhp and 440Nm of torque, and 261bhp and 550Nm of torque, respectively. Also on offer is a 48V mild-hybrid system that produces 20bhp and 200Nm. A nine-speed automatic transmission is standard across the range.On the outside, the Mercedes-Benz C-Class features sleeker LED headlamps with integrated LED DRLs, a set of new split LED tail lights, and new 18-inch alloy wheels.Inside, the new-gen Mercedes-Benz C-Class will come equipped with a 12.3-inch touchscreen infotainment system, a fully-digital instrument cluster, the latest MBUX 7 connectivity, a flat-bottom steering wheel with Nappa leather, and biometric authentication via fingerprint and voice.",
      "pros": "Beautiful design - Looks younger more athletic and distinctly different than before, Driving dynamics - Taut ride but settled and absorbent quick and progressive steering, Peppy engines - Enough grunt on tap to keep one involved unrestricted fun on the go, Comfortable spacious - Roomier at the rear than before distinct S-Class flavour, Feature-packed - Name the function and the new C-Class will almost certainly have it",
      "cons": "Boot - The spare tyre eats into the usable space and ultimately ruins it altogether, Ingress - After being spoilt by SUVs the C-Class isn't the easiest to get in/out of, Ride is a tad noisy - One can hear/feel the suspension thump over sharp-edged bumps"
    },
    {
      "id": 2,
      "make": "Mercedes-Benz",
      "model": "Mercedes-Benz GLA",
      "fuelType": "Petrol & Diesel",
      "accelaration": "7.22 to 8.7 seconds",
      "topSpeed": "210 to 222 kmph",
      "engine": "1332 to 1950 cc",
      "price": "Rs. 52.66 Lakh",
      "year": "2021",
      "image": "https://imgd.aeplcdn.com/664x374/n/cw/ec/44784/gla-exterior-right-front-three-quarter.jpeg?q=75",
      "seatingCapacity": "5",
      "colors": "Cosmos Black, Denim Blue, Mountain Grey, Polar White, Iridium Silver",
      "variants": " GLA 200, GLA 220d, GLA 220d 4Matic, AMG GLA 35 4Matic",
      "summary": "Under the hood, the standard GLA can be had with one petrol and one diesel engine. The new 1.3-litre petrol is tuned to develop 161bhp and 250Nm of torque while the potent 2.0-litre diesel motor puts out 188bhp and 400Nm of torque. The latter is also available with an all-wheel-drive configuration. The petrol guise is mated to a seven-speed DCT while the diesel version gets an eight-speed automatic transmission. Appearance-wise, the 2021 GLA is now taller, bigger, and has increased ground clearance over the previous generation model. This gives it the much-needed SUV appeal that was lacking in the older model. Up front, there is a single-slat horizontal grille flanked by revised LED headlamps. Although the fog lamps have been given a miss, the front bumper now sports a bone-like pattern along with a three-box bash plate at the bottom. The GLA sits on a comfortable set of 18-inch alloy wheels surrounded by squared-off wheel arches. The rear gets the familiar sleek LED tail lamps. The split units narrow down towards the boot lid in a typical Mercedes fashion. The lower half gets heavy plastic cladding with a touch of chrome that lends it a sporty look. The cabin of this 2021 GLA has been revamped to bring it on par with the bigger siblings in the family. Taking the centre stage is the two-screen setup measuring 10.25 inches each for the infotainment and the driver’s instrument cluster. The touchscreen system is powered by the NTG6 generation of MBUX with the latest software and Apple CarPlay and Android Auto connectivity. Meanwhile, the Progressive trims get a beige and black upholstery with an open walnut combination on the dashboard. To meet modern requirements, the GLA also packs in ‘Mercedes Me’ connected services that include Alexa voice assistant, remote door lock/unlock, remote engine start, speed alert, and geo-fencing among others.Other features include electrically adjustable front seats with memory function, wireless smartphone charging, two-zone automatic climate control, a panoramic sunroof, and 64-colour ambient lighting.",
      "pros": "Performance - Refined/tractable motors that have sharp/eager responses good drivability, Cabin - Spacious/airy despite dark materials quality exquisitely crafted interiors, Design - Looks more like an SUV since the previous model had a \"hatch on stilts\" stance, Drivetrain options - Gets two powertrain choices with the 4MATIC option to select from, Absorbent damping - Very comfortable ride quality owing to the well-judged suspension",
      "cons": "Rear seat - The rear bench lacks appropriate thigh support is best for two occupants, Boot space - Restricted because the spare wheel takes up most of the usable space, Expensive - The top-end versions of the GLA are on the pricier side"
    },
    {
      "id": 3,
      "make": "Mercedes-Benz",
      "model": "Mercedes-Benz Maybach S-Class",
      "fuelType": "Hybrid & Petrol",
      "accelaration": "4.5 to 4.8 seconds",
      "topSpeed": "250 kmph",
      "engine": "3982 to 5980 cc",
      "price": "Rs. 3.40 Crore",
      "year": "2022",
      "image": "https://imgd.aeplcdn.com/664x374/n/cw/ec/115149/maybach-s-class-exterior-right-front-three-quarter.jpeg?isig=0&q=75",
      "seatingCapacity": "4",
      "colors": "Designo Kalahari Gold Metallic, Designo Cashmere White Magno, Designo Patagonia Red Bright, Designo Selenite Grey Magno, Designo Diamond White Bright with Obsidian Black, Mojave Silver with Onyx Black, High-tech Silver with Selenite Grey, Nautic Blue High-tech Silver, Obsidian Black with High-Tech Silver, Obsidian Black with Selenite Grey, Obsidian Black with Rubellite Red, Onyx Black with Designo Kalahari Gold Metallic, Rubellite Red with Designo Kalahari Gold Metallic, Emerald Green with Mojave Silver",
      "variants": "S580, S680",
      "summary": "Powering the new Mercedes-Maybach S-Class is a 4.0-litre twin-turbo V8 engine with a 48V mild-hybrid system in the S580 guise and a 6.0-litre V12 motor. The former is capable of producing 496bhp and 700Nm of torque, while the latter is tuned to produce 603bhp and 900Nm of torque. A nine-speed automatic transmission is standard across the range. The new-gen Maybach S-Class features the signature chrome grille with vertical slats and the Mercedes-Maybach branding along with the Mercedes-Benz logo on the hood. The grille is flanked by LED headlamps with integrated L-shaped LED DRLs on either side, chrome inserts for the bumper, chrome window line, 20-inch alloy mono-block wheels, Maybach logo on the C-pillar, wrap-around LED tail lights, and chrome inserts for the boot-lid as well as the rear bumper. Inside, the Mercedes-Maybach S-Class features powered comfort rear doors, two individual seats for the second row with reclining and massage functions, leg rests, foldable trays, a 10-litre refrigerator that can house champagne bottles and champagne flutes, heated and cooled cup holders, and a MBUX tablet in the rear arm-rest to control various functions. A few other notable features include a 12.8-inch fully-digital instrument cluster, a 12.3-inch touchscreen infotainment system, MBUX connectivity, Heads-Up Display (HUD), an airbag for the second-row passengers, air suspension, rear-wheel steering, Level 3 autonomy, and a range of active and passive safety features.",
      "pros": "Ultra-luxurious cabin, Loaded with tech, Powerful motors",
      "cons": "Cabin looks overdone, Some switchgear looks cheap"
    },
    {
      "id": 4,
      "make": "Mercedes-Benz",
      "model": "Mercedes-Benz GLS",
      "fuelType": "Diesel",
      "accelaration": "6.3 seconds",
      "topSpeed": "238 kmph",
      "engine": "2925 cc",
      "price": "Rs. 1.29 Crore",
      "year": "2021",
      "image": "https://imgd.aeplcdn.com/664x374/n/cw/ec/45390/gls-exterior-right-front-three-quarter-2.jpeg?q=75",
      "seatingCapacity": "5",
      "colors": "Obsidian Black, Cavansite Blue, Selenite Grey, Mojave Silver, Hyacinth Red, Polar White",
      "variants": "400d 4MATIC",
      "summary": "The SUV from Mercedes-Benz is 5,207mm long, 2,157mm broad, and boasts a height of 1,823mm. Inside the GLS400d you get ambient lighting with 64 colours, a hand comforter, control switches and cup holders in the centre console in silver chrome, a control bar for climate control, an integral illuminated stowage compartment, the all-new multifunction sports steering wheel in Nappa leather, and memory package front with seat kinetics. GLS400d gets nine airbags as a standard safety feature. Apart from this, it also gets five-zone automatic climate control, power boot, power-folding third row, electronically adjustable steering, remote trunk opener, and air quality control. ",
      "pros": "Powerful engines, Loaded with creature comforts, Endless personalisation options",
      "cons": "It feels cumbersome to drive in the city, The last row is a squeeze, Expensive"
    },
    {
      "id": 5,
      "make": "Mercedes-Benz",
      "model": "Mercedes-Benz AMG GLC43 Coupe",
      "fuelType": "Petrol",
      "accelaration": "4.9 seconds",
      "topSpeed": "250 kmph",
      "engine": "2996 cc",
      "price": "Rs. 86.99 Lakh",
      "year": "2023",
      "image": "https://imgd.aeplcdn.com/664x374/n/cw/ec/50924/amg-glc-43-coupe-exterior-right-front-three-quarter.jpeg?q=75",
      "seatingCapacity": "5",
      "colors": "",
      "variants": "GLC 43 AMG 4MATIC",
      "summary": "Mercedes-Benz India has introduced the locally assembled GLC 43 AMG 4MATIC Coupe in the country at Rs 76.70 lakh (ex-showroom, all India). It is the first ‘Made-in-India’ AMG product to roll out of the brand’s facility in Chakan, Pune. While all other AMG models arrive in the country via the CBU route, the GLC 43 AMG 4MATIC Coupe is also the first AMG car to arrive in the country via the CKD route. Feature highlights of the Mercedes-Benz GLC 43 AMG 4MATIC Coupe include the Panamericana grille, LED headlamps, 20-inch AMG-spec alloy wheels, new LED tail lights, and quad-tip AMG performance exhausts. Inside, the model will come equipped with the latest version of the MBUX system, a 10.25-inch touchscreen infotainment system, a 12.3-inch fully digital instrument console, five drive modes, seven airbags, active braking assist, and sport seats. Under the hood of the model will be a 3.0-litre V6 petrol engine producing 385bhp and 520Nm of torque. This engine sends power to all four wheels via a nine-speed automatic transmission, enabling speeds of 0-100kmph in 4.9 seconds.",
      "pros": "Blistering performance with a quick-shifting gearbox, Sorted dynamics despite being an SUV, AMG brag rights",
      "cons": "Rear seat practicality, Steering could have been more feelsome, Efficiency"
    },
    {
      "id": 6,
      "make": "Mercedes-Benz",
      "model": "Mercedes-Benz GLC Coupe",
      "fuelType": "Petrol & Diesel",
      "accelaration": "6.3 to 6.6 seconds",
      "topSpeed": "233 to 240 kmph",
      "engine": "1950 to 1991 cc",
      "price": "Rs. 73.46 Lakh",
      "year": "2022",
      "image": "https://imgd.aeplcdn.com/664x374/n/cw/ec/45477/mercedesbenz-glc-coupe-right-front-three-quarter1.jpeg?q=75",
      "seatingCapacity": "5",
      "colors": "Black",
      "variants": "300 4MATIC, 300d 4MATIC",
      "summary": "Mercedes-Benz India will launch the GLC Coupe facelift on 3 March. The model is essentially the Coupe version of the GLC facelift that was launched in India in December last year. Rivals to the GLC facelift will include the BMW X4 and the Porsche Macan. Powertrain options on the Mercedes-Benz GLC Coupe facelift could include a 2.0-litre, four cylinder turbo-petrol engine producing 258bhp and 370Nm of torque while the 300d will be propelled by a 2.0-litre four cylinder turbo diesel engine producing 245bhp and 500Nm of torque. Transmission duties will be taken care of by a nine-speed automatic transmission while the brand’s 4-Matic all-wheel-drive would be offered as standard across the range. The AMG variant could also be offered upon launch. Design highlights of the new Mercedes-Benz GLC Coupe include new LED headlamps, new diamond pattern grille, redesigned front and rear bumpers, new LED tail lights, new diffuser and angular exhaust tips. Inside, the model will come equipped with a new multifunction steering wheel, 10.25-inch touchscreen infotainment system with MBUX interface and a 12.3-inch instrument cluster.",
      "pros": "Coupe design, Potent engines, Outstanding long-distance cruiser",
      "cons": "Not a daily driver, Uncomfortable ride"
    },
    {
      "id": 7,
      "make": "Mercedes-Benz",
      "model": "Mercedes-Benz EQS",
      "fuelType": "Electric",
      "accelaration": "4.3 seconds",
      "topSpeed": "210 kmph",
      "engine": "",
      "price": "Rs. 73.46 Lakh",
      "year": "2022",
      "image": "https://imgd.aeplcdn.com/664x374/n/cw/ec/131249/eqs-580-4matic-exterior-right-front-three-quarter-2.jpeg?isig=0&q=75",
      "seatingCapacity": "5",
      "colors": "",
      "variants": "580 4Matic",
      "summary": "The brand introduced the EQS 580 4Matic in India on 30 August, 2022. It is being locally assembled at its plant in Pune, Maharashtra. Powering the EQS 580 4Matic is a dual electric motor setup and a 107.8kWh battery pack. These motors produce 516bhp and 855Nm. Further, it provides a WLTP-certified range of 770km. The electric sedan supports 200kW DC rapid charging. The exterior highlights include a coupé-inspired roofline, LED DRLs across the width of the fascia, digital LED headlamps, 3D helix taillights with a light bar, 20-inch aero alloy wheels, and flush door handles. Inside, it features a 56-inch single-piece MBUX Hyperscreen, which consists of three OLED screens. Further, the cabin comes with two dual-tone schemes, a Burmester 3D sound system, two wireless charging pads, powered rear seats with ventilation and massage, and powered front seats with ventilation, heating, and massage functions.",
      "pros": "Extravagant cabin, Claims a range of more than 500km, Tech fest",
      "cons": "Floaty suspension, Rival brands offer more range, Too many reflections off the screen"
    },
    {
      "id": 8,
      "make": "Mercedes-Benz",
      "model": "Mercedes-Benz AMG E53 Cabriolet",
      "fuelType": "Petrol",
      "accelaration": "4.5 seconds",
      "topSpeed": "210 kmph",
      "engine": "2999 cc",
      "price": "Rs. 1.30 Crore",
      "year": "2023",
      "image": "https://imgd.aeplcdn.com/664x374/n/cw/ec/137541/amg-e53-cabriolet-exterior-right-front-three-quarter-8.jpeg?isig=0&q=75",
      "seatingCapacity": "4",
      "colors": "",
      "variants": "4Matic",
      "summary": "The model was launched in India on 6 January, 2023. Propelling the E53 AMG Cabriolet is a 3.0-litre, six-cylinder turbo-petrol engine paired with a mild-hybrid motor generating a combined output of 429bhp and 520Nm of torque. Transmission duties will be handled by a nine-speed automatic transmission sending power to all four wheels. The E53 AMG Cabriolet can sprint from 0-100kmph in 4.5 seconds, all the way up to a top speed of 250kmph. In terms of exterior design, the convertible from Mercedes-Benz features the signature Panamericana grille with vertical slats, LED headlamps and DRLs, an aggressive design for the front bumper, two-piece LED tail lights, quad-tip exhausts, and a soft-top roof. Inside, the Mercedes-Benz E53 AMG Cabriolet is equipped with a large single-piece screen that houses the touchscreen infotainment system and fully digital instrument console, a flat-bottom multifunction steering wheel, a Burmester-sourced music system, AMG sports seats, wireless charging, and ambient lighting.",
      "pros": "Quick, Luxurious tech fest, Surprisingly practical for an AMG",
      "cons": "Stiff ride quality, Steering lacks feedback"
    },
    {
      "id": 9,
      "make": "Mercedes-Benz",
      "model": "Mercedes-Benz AMG GT 63 S 4MATIC Plus",
      "fuelType": "Petrol",
      "accelaration": "",
      "topSpeed": "",
      "engine": "3982 cc",
      "price": "Rs. 2.70 Crore",
      "year": "2023",
      "image": "https://imgd.aeplcdn.com/664x374/n/cw/ec/45126/mercedesbenz-amg-gt-4-door-coupe-right-side0.jpeg?q=75",
      "seatingCapacity": "5",
      "colors": "",
      "variants": "Limousine",
      "summary": "The AMG GT 63S 4matic+ Coupé is the fastest four-door luxury sports car in the world according to its lap timing around the Nürburgring Nordschleife, where it was even faster than the AMG GT R. It is the high-spec model in the AMG GT 4-door Coupé line up. This sports car can go from 0 to 100kmph in just 3.2 seconds. The GT 4-door Coupé features a wide Pan Americana grille. Besides, there are LED multibeam headlamps with high beam assist. The sports car also gets AMG front and rear bumpers along with an active rear spoiler. Additionally, it comes with a radiator blind and an Airpanel placed in front of the air inlet inspired by the AMG GT R. The cabin gets AMG sport seats with two-tone Nappa leather. There are two 12.3-inch screens for the digital driver display and the infotainment touchscreen system with MBUX. The sports car also comes with a 14-speaker and 640-watt Burmester surround sound system. Additionally, there are 64 colours of ambient lighting and a wireless charging pad. The GT 63S 4-door Coupé gets an AMG three-stage speed-sensitive steering wheel too. This sports car has plenty of features that include AMG dynamic plus package, AMG rear-axle steering, AMG 4Matic+ all-wheel-drive system, AMG ride control+, active park assist with park Tronic, 360-degree surround cameras and AMG high-performance brakes. It features a 3982cc V8 twin-turbocharged petrol engine paired with a nine-speed TCT automatic transmission and this mill produces 630bhp from 5,500 to 6,500rpm and 900Nm of torque between 2,500 and 4,500rpm.",
      "pros": "Luxurious cabin, Striking coupe design, The most powerful four-door coupe",
      "cons": "Unforgiving ride, Ground clearance, Extremely expensive"
    },
    {
      "id": 10,
      "make": "Mercedes-Benz",
      "model": "Mercedes-Benz AMG SL55 Roadster",
      "fuelType": "Petrol",
      "accelaration": "3.9 seconds",
      "topSpeed": "295 kmph",
      "engine": "3982 cc",
      "price": "Rs. 2.35 Crore",
      "year": "2023",
      "image": "https://imgd.aeplcdn.com/664x374/n/cw/ec/148919/amg-sl55-roadster-exterior-right-front-three-quarter-2.jpeg?isig=0&q=75",
      "seatingCapacity": "4",
      "colors": "",
      "variants": "4Matic+",
      "summary": "The SL55 AMG Roadster from Mercedes-Benz is available in a single, fully loaded variant. What features are available in the Mercedes-AMG SL55 Roadster?The exterior of the 2023 SL55 AMG gets flush-fitting door handles, the signature Panamericana grille, sweptback LED headlamps, a sleek air dam, new 20-inch alloy wheels, carbon-fibre ORVMs, LED taillights, quad-tip exhausts, and an adjustable spoiler. In terms of features, the model comes equipped with an 11.9-inch, vertically aligned MBUX touchscreen infotainment system with a tilt function, a fully digital instrument console, carbon-fibre and Alcantara inserts, ambient lighting, and multiple AMG-specific inserts. The soft top of the new Mercedes-AMG SL55 Roadster can be opened or closed in 15 seconds, up to speeds of 60kmph. The two-door convertible has a seating capacity of four occupants. What are the engine, performance, and specifications of the Mercedes-AMG SL55 Roadster?The SL55 Roadster from Mercedes-AMG is propelled by a 4.0-litre, twin-turbo V8 engine producing 476bhp and 700Nm of torque. Mated with a nine-speed automatic transmission, the model can go from 0-100kmph in 3.8 seconds up to an electronically-limited top speed of 250kmph.",
      "pros": "Luxurious cabin, Striking coupe design, The most powerful four-door coupe",
      "cons": "Unforgiving ride, Ground clearance, Extremely expensive"
    }
  ]